{
    "lang": [
        "en",
        "dk"
    ],
    "nav": [
        [
            "Home",
            "Timeline",
            "Contact"
        ],
        [
            "Hjem",
            "Tidslinje",
            "Kontakt"
        ]
    ],
    "startTitel": [
        "Hello, Welcome",
        "Hej, Velkommen"
    ],
    "startTitelBes": [
        "My name is David Hansson, and I’m 17 years old. My everyday life consists of school, where I’m currently in my second year, under the branch HTX. We have a focus on programming and technology on my line, which has always been one of my big passions since a young age. ",
        "Mit navn er David Hansson og jeg er 17 år gammel. Til dagligt går jeg i 2.g, under grenen HTX. På min linje har vi fokus på programmering og teknologi, hvilket har været en af mine store passioner siden en ung alder."
    ],
    "skillsInfo": [
        "What can I do?",
        "Hvad kan jeg?"
    ],
    "skillsBes": [
        [
            "JavaScript was my beginner language. I began learning at the age of 14, shortly after discovering and learning HTML. I learned 2 years after the Framework React, that 4hansson.dk also is built on. I have developed 2 apps in React Native, that both are released on Google Play. ",
            "I first learned Swift as a 17-year-old. I got my first Swift-intern job, with zero Swift knowledge. I worked with the app and company Listen To News for 1 year.",
            "The second language I learned was PHP. It gave me an understanding of what web development was about. It was also my first insight into SQL-databases. I learned this language as a 15-year-old.",
            "I learned CSS under my HTML/JavaScript time and under the development of my first apps (in React Native). I have since then used more time on CSS under the development of 4hansson.dk."
        ],
        [
            "JavaScript var mit begyndersprog. Jeg begyndte at lære det som 14-årig. Jeg lærte 2 år efter Frameworket React, som 4hansson.dk er udviklet på. Jeg har udviklet 2 apps i React Native, som begge er udgivet på Google Play. ",
            "Jeg lærte først Swift som 17-årig. Jeg fik mit første swift-praktikant job, med nul Swift erfaring. Jeg arbejdede med appen og firmaet Listen To News gennem 1 år.",
            "Det andet sprog jeg lærte, var PHP. Det gav mig forståelse for hvordan web udvikling virkelig foregik. Det var også mit første indblik på SQL-databaser. Jeg lærte dette sprog som 15-årig.",
            "Jeg lærte CSS under min HTML/JavaScript tid og under udviklingen af mine første apps (i React Native). Har efterfølgende brugt mere tid på css under udviklingen af 4hansson.dk."
        ]
    ],
    "langInfo": [
        "Choose Language",
        "Vælg Sprog"
    ],
    "fourthTitle": [
        "Frontend? Yes that's me",
        "Frontend? Ja det mig"
    ],
    "fourtBes": [
        "My specialty is frontend. Everything from Apps for Android and iOS to streamlined websites. I am always up to date with the latest technology and I always strive to learn something new.",
        "Mit speciale er indenfor frontend. Alt fra Apps til Android og iOS til strømlinede hjemmesider. Jeg er altid med på den nyeste teknologi, og jeg stræber altid efter at lære noget nyt."
    ],
    "contactMainTitle": [
        "Contact Me",
        "Kontakt Mig"
    ],
    "contactMainTypes": [
        [
            "Location",
            "Email",
            "Phone",
            "LinkedIn"
        ],
        [
            "Lokalitet",
            "Email",
            "Telefon",
            "LinkedIn"
        ]
    ],
    "contactMainPhone": [
        [
            "Call",
            "or",
            "write",
            ""
        ],
        [
            "Ring",
            "eller",
            "skriv",
            "til mig"
        ]
    ],
    "TwitterTitle": [
        "David World Famous",
        "Verdenskendt"
    ],
    "contantGitTitle": [
        "Check out my latest update on 4hansson",
        "Tjek min seneste opdatering på 4hansson"
    ],
    "GuestBookTitle": [
        "Guest Book",
        "Gæstebog"
    ],
    "GuestBookWelcome": [
        "Welcome ",
        "Velkommen "
    ],
    "timeline": [
        [
            {
                "title": "Position at Listen To News",
                "subTitle": "2. G • 16 Years Old",
                "text": ["First positions as a developer! I joined the company Listen To news. Here I program Swift apps in Xcode. ", "With them, I have learned all about the startup environment and how it works."],
                "date": "Sep. 2019 - Present",
                "type": "work",
                "links": [{"title": "LTN Website", "URL": "https://listentonews.com"}, {"title": "LTN LinkedIn", "URL": "https://www.linkedin.com/company/listen-to-news/"}]
            },
            {
                "title": "Fullstack Pack",
                "subTitle": "1. G • 15 - 16 Years Old",
                "text": ["To learn the principles behind databases and data structures, I read the book “Head First PHP & MySQL”. I created with my new knowledge a file sharing and a messaging -program.", "After that, I learned React JS as well as React Native and began on my new portfolio site (this site)."],
                "date": "2018 - 2019",
                "type": "",
                "links": []
            },
            {
                "title": "Education at NEXT Sukkertoppen HTX",
                "subTitle": "1. G - 3. G • 15 - 18 Years Old",
                "text": ["I was tired of subjects like German, Social studies, History and more. That is why I chose a technical gymnasium – HTX (Higher Technical Examination) and the line Computer Science. On that line, we had more relevant subjects like programming, mathematics, technology and technical-subject."],
                "date": "2018 - 2021",
                "type": "school",
                "links": [{"title": "NEXT", "URL": "https://nextkbh.dk/gymnasier/sukkertoppen-gymnasium/htx/computer-science"}]
            },
            {
                "title": "Websites",
                "subTitle": "7th - 9th Grade • 12 - 15 Years old ",
                "text": ["The next things I learned were websites – HTML, CSS and JS. I read the book “Head First JavaScript Programming”. I of course made a portfolio site, and proudly showed it to everyone.", "The most known program I made was a “Slot machine” game, that got very famous at my school."],
                "date": "2015 - 2018",
                "type": "",
                "links": []
            },
            {
                "title": "The beginning",
                "subTitle": "4th Grade • 9 Years Old",
                "text": ["I was introduced to programming in 4th grade through the school computers. Vi often got computers in the Danish lections, where I instead used my time on coding. Here I experimented with Batch files. I played around with the language and made programs such as “Who Wants To Be A Millionaire?”, colorful calculators and small games.", "I also looked at C# and read the book “C# Programming for Kids” with the now old program Visual Studio.Net 2008. Here I made games like “Hangman” and “Tic-Tac-Toe”."],
                "date": "2012",
                "type": "",
                "links": []
            }
        ],
        [
            {
                "title": "Stilling hos Listen To News",
                "subTitle": "2. G • 16 År Gammel",
                "text": ["Første stilling som udvikler! Jeg kom ind hos firmaet Listen To News. Her programmerer jeg Swift apps i Xcode. ", "Hos dem har jeg lært alt om startup miljøet og hvordan det fungerer."],
                "date": "Sep. 2019 - Nu",
                "type": "work",
                "links": [{"title": "LTN Side", "URL": "https://listentonews.com"}, {"title": "LTN LinkedIn", "URL": "https://www.linkedin.com/company/listen-to-news/"}]
            },
            {
                "title": "Fullstack Pakken",
                "subTitle": "1. G • 15 - 16 År Gammel",
                "text": ["For at lære principperne bag databaser og datastrukturer læste jeg bogen ”Head First PHP & MySQL”. Jeg lavede med min nye viden et fil delings og et besked -program.", "Efter det lærte jeg React JS samt React Native, og begyndte på min nye portfolio side (denne side)."],
                "date": "2018 - 2019",
                "type": "",
                "links": []
            },
            {
                "title": "Uddannelse hos NEXT Sukkertoppen HTX",
                "subTitle": "1. G - 3. G • 15 - 18 År Gammel",
                "text": ["Jeg var træt af fag som Tysk, Samfundsfag, Historie og mere. Derfor valgte jeg et teknisk gymnasium - HTX (Højre Teknisk Eksamen) og linjen Computer Science. På den linje havde vi mere relevante fag som programmering, matematik, teknologi og teknikfag."],
                "date": "2018 - 2021",
                "type": "school",
                "links": [{"title": "NEXT", "URL": "https://nextkbh.dk/gymnasier/sukkertoppen-gymnasium/htx/computer-science"}]
            },
            {
                "title": "Hjemmesider",
                "subTitle": "7. - 9. Klasse • 12 - 15 År Gammel",
                "text": ["Det næste jeg lærte, var hjemmesider - HTML, CSS og JS. Jeg læste bogen ”Head First JavaScript Programming”. Jeg lavede selvfølgelig en portfolio side, og viste den stolt frem til alle :) ", "Mit mest kendte program jeg lavede, var et ”Slot machine” spil, som blev meget populært på min skole."],
                "date": "2015 - 2018",
                "type": "",
                "links": []
            },
            {
                "title": "Starten",
                "subTitle": "4. Klasse • 9 År Gammel",
                "text": ["Jeg blev introduceret til programmering i 4. klasse igennem skolens computere. Vi fik ofte computere tildelt i dansk timerne, hvor jeg i stedet brugte min tid på at programmere. Her eksperimenterede jeg med Batch files. Jeg legede rundt med sproget og lavede programmer som ”Hvem vil være millionær?”, farverige lommeregnere og små spil.", "Jeg kiggede også på C# og læste bogen ”C# Programming for Kids” med det nu gamle program Visual Studio.Net 2008. Her lavede jeg spil som ”Hangman” og ”Kryds og bolle”"],
                "date": "2012",
                "type": "",
                "links": []
            }
        ]
    ],
    "timeLineTitle": [
        "My Timeline",
        "Min Tidslinje"
    ]
}