{
    "lang": [
        "en",
        "dk"
    ],
    "nav": [
        [
            "Home",
            "Projects",
            "Contact"
        ],
        [
            "Hjem",
            "Projekter",
            "Kontakt"
        ]
    ],
    "startTitel": [
        "Hello, Welcome",
        "Hej, Velkommen"
    ],
    "startTitelBes": [
        "My name is David Hansson, and I’m 17 years old. My everyday life consists of school, where I’m currently in my second year, under the branch HTX. We have a focus on programming and technology on my line, which has always been one of my big passions since a young age. ",
        "Mit navn er David Hansson og jeg er 17 år gammel. Til dagligt går jeg i 2.g, under grenen HTX. På min linje har vi fokus på programmering og teknologi, hvilket har været en af mine store passioner siden en ung alder."
    ],
    "skillsInfo": [
        "What can I do?",
        "Hvad kan jeg?"
    ],
    "skillsBes": [
        [
            "JavaScript was my beginner language. I began learning at the age of 14, shortly after discovering and learning HTML. I learned 2 years after the Framework React, that 4hansson.dk also is built on. I have developed 2 apps in React Native, that both are released on Google Play. ",
            "I first learned Swift as a 17-year-old. I got my first Swift-intern job, with zero Swift knowledge. I worked with the app and company Listen To News for 1 year.",
            "The second language I learned was PHP. It gave me an understanding of what web development was about. It was also my first insight into SQL-databases. I learned this language as a 15-year-old.",
            "I learned CSS under my HTML/JavaScript time and under the development of my first apps (in React Native). I have since then used more time on CSS under the development of 4hansson.dk."
        ],
        [
            "JavaScript var mit begyndersprog. Jeg begyndte at lære det som 14-årig. Jeg lærte 2 år efter Frameworket React, som 4hansson.dk er udviklet på. Jeg har udviklet 2 apps i React Native, som begge er udgivet på Google Play. ",
            "Jeg lærte først Swift som 17-årig. Jeg fik mit første swift-praktikant job, med nul Swift erfaring. Jeg arbejdede med appen og firmaet Listen To News gennem 1 år.",
            "Det andet sprog jeg lærte, var PHP. Det gav mig forståelse for hvordan web udvikling virkelig foregik. Det var også mit første indblik på SQL-databaser. Jeg lærte dette sprog som 15-årig.",
            "Jeg lærte CSS under min HTML/JavaScript tid og under udviklingen af mine første apps (i React Native). Har efterfølgende brugt mere tid på css under udviklingen af 4hansson.dk."
        ]
    ],
    "langInfo": [
        "Choose Language",
        "Vælg Sprog"
    ],
    "fourthTitle": [
        "Frontend? Yes that's me",
        "Frontend? Ja det mig"
    ],
    "fourtBes": [
        "My specialty is frontend. Everything from Apps for Android and IOS to streamlined websites. I am always up to date with the latest technology and I always strive to learn something new.",
        "Mit speciale er indenfor frontend. Alt fra Apps til Android og IOS til strømlinede hjemmesider. Jeg er altid med på den nyeste teknologi, og jeg stræber altid efter at lære noget nyt."
    ],
    "contactMainTitle": [
        "Contact Me",
        "Kontakt Mig"
    ],
    "contactMainTypes": [
        ["Location", "Email", "Phone", "LinkedIn"],
        ["Lokalitet", "Email", "Telefon", "LinkedIn"]
    ],
    "contactMainPhone": [
        ["Call", "or", "write", ""],
        ["Ring", "eller", "skriv", "til mig"]
    ]
}